[M_TaggartBiography MissionDefinition]
MissionDescription="Sir Hammerlock needs information about the Tyrant, and his former lover Taggart begins writing a book about his efforts to destroy the creature.. Hammerlock wants you to buy Taggart's audiobooks.."
TurnInDescription="You search for Taggart's missing head and discover some sad truths in the process. All the faith in the world cannot save you from fear and loneliness.. You have to pay instead!"

[M_TaggartBiography:MissionObjectiveDefinition_6 MissionObjectiveDefinition]
ProgressMessage="You are a hunter."
